{
  "projects": [
    {
      "title": "Russian Word Profiler",
      "slug": "russian-word-profiler",
      "description": "Linguistics analysis tool for researchers and teachers of Russian",
      "technologies": ["React", "Redux", "Python", "Flask", "JavaScript"],
      "githubUrl": "https://github.com/MichealNestor01/RussianWordProfiler/",
      "image": "/images/portfolio/profilerWide.png",
      "date": "2024-08-08",
      "content": "Joint research project with the Russian and Slavonic Studies Department at the University of Leeds. It is a linguistics research tool, and education tool which aims to emulate the feature set of the AntWordProfiler, (Dr Laurence Anthony), except through a web based interface and designed for Russian. This project's point of contact with the department was Dr. Pavel Gudoshnikov and it was developed in collaboration with Ben Thirkill who lead design and UX",
      "isRunnable": true,
      "demoUrl": "https://russianwordprofiler.pythonanywhere.com/",
      "mobileFriendly": false,
      "tags": ["Web Apps"]
    },
    {
      "title": "Blackjack in C",
      "slug": "blackjack-in-c",
      "description": "Simple command-line blackjack game written in C",
      "technologies": ["C", "TDD"],
      "githubUrl": "https://github.com/MichealNestor01/blackjack-in-c",
      "image": "/images/portfolio/blackjackMain.png",
      "date": "2025-01-31",
      "content": "My first time using C in over 2 years, and I did not use an LLM assistant for code generation, though ChatGPT did help with the Makefile. Uses Unity for unit tests, and test driven development was followed throughout. There is room for future development to clean up the play_game and play_round functions and add tests for them, as well as player options such as doubling down and surrendering.",
      "isRunnable": false,
      "mobileFriendly": false,
      "tags": ["Command Line Tools"]
    },
    {
      "title": "Jack Compiler",
      "slug": "jack-compiler",
      "description": "Compiler for the Jack language built for COMP2932",
      "technologies": ["C", "Compilers"],
      "githubUrl": "https://github.com/MichealNestor01/jack-compiler",
      "image": "/images/portfolio/compilerDiagram.png",
      "date": "2024-06-01",
      "content": "A compiler that translates the Jack language into Jack VM code using a recursive descent parser. Jack and the VM are the languages from the nand2tetris course. This was the primary assessed piece of work for COMP2932 Compiler Design and Construction; the code was tested using test scripts provided by Dr Mhd. A. Alsalka and received 100% of the available marks.\n\nI am proud of what I accomplished with this program, and it was a great opportunity to cement my confidence in C.",
      "isRunnable": false,
      "mobileFriendly": false,
      "tags": ["Command Line Tools", "University Coursework"]
    },
    {
      "title": "Tor Scraper Docker",
      "slug": "tor-scraper-docker",
      "description": "Docker image for scraping HTML and taking screenshots of sites accessible over the Tor network",
      "technologies": ["Python", "Docker", "Web Scraping"],
      "githubUrl": "https://github.com/MichealNestor01/tor-scraper-docker",
      "image": "/images/portfolio/torMain.png",
      "date": "2023-09-01",
      "content": "Joint project with Leonie Kennedy. A Docker image that runs a Python scraper to fetch HTML and capture screenshots from any URL, including onion sites. The container uses a shared volume for output; you can run it in two modes, pass a single URL, or a text file of URLs to scrape in batch. This project uses a modified version of selenium for tor (tor-selenium) and makes use of a virtual frame buffer and modified tor config files to enable firefox to run through the terminal while still be able to capture video output.",
      "isRunnable": false,
      "mobileFriendly": false,
      "tags": ["Command Line Tools"]
    },
    {
      "title": "GTOPO30 Utilities",
      "slug": "gtopo30-utilities",
      "description": "Set of utilities for manipulating the GTOPO30 digital elevation dataset",
      "technologies": ["C"],
      "githubUrl": "https://github.com/MichealNestor01/gtopo30-utilities",
      "image": "/images/portfolio/gtopoMain.png",
      "date": "2022-05-01",
      "content": "A suite of command-line utilities for working with the GTOPO30 dataset, a 30 arc-second resolution global elevation dataset from USGS EROS. The tools include gtopoEcho (copy DEM files), gtopoComp (compare two DEMs), gtopoReduce (reduce resolution by a factor), gtopoTile (split into tiles), gtopoAssemble (combine tiles), gtopoPrintLand (ASCII terrain visualisation with sea/hill/mountain thresholds), and gtopoAssembleReduce (assemble and reduce in one step). Built in C with a Makefile for building individual or all executables.",
      "isRunnable": false,
      "mobileFriendly": false,
      "tags": ["Command Line Tools", "University Coursework"]
    },
    {
      "title": "PGM Utilities",
      "slug": "pgm-utilities",
      "description": "Set of utilities written in C to manipulate PGM (portable graymap) image files",
      "technologies": ["C"],
      "githubUrl": "https://github.com/MichealNestor01/pgm-utilities",
      "image": "/images/portfolio/pgmTile.png",
      "date": "2022-03-01",
      "content": "A suite of command-line utilities for PGM files, entirely written in C. The tools include pgmEcho (copy), pgmComp (compare two images), pgma2b and pgmb2a (ASCII/binary conversion), pgmReduce (reduce resolution by a factor), pgmTile (split into tiles), and pgmAssemble (combine tiles into an image). The repo includes a test script (testscript.sh) to verify correctness.",
      "isRunnable": false,
      "mobileFriendly": false,
      "tags": ["Command Line Tools", "University Coursework"]
    },
    {
      "title": "Java Wordle",
      "slug": "java-wordle",
      "description": "Command-line Wordle game made in Java",
      "technologies": ["Java"],
      "githubUrl": "https://github.com/MichealNestor01/java-wordle",
      "image": "/images/portfolio/wordleMain.png",
      "date": "2022-03-01",
      "content": "Coursework for COMP1721 Object Oriented Programming at the University of Leeds. A version of Wordle playable in the terminal. Features include playing today's wordle or a specific day's wordle, viewing your last game, historical game statistics, and a histogram of guess-number distribution. Built with Java (Game, Guess, WordList, Wordle, GameException).",
      "isRunnable": false,
      "mobileFriendly": false,
      "tags": ["Command Line Tools", "University Coursework"]
    },
    {
      "title": "Python Password Manager",
      "slug": "python-password-manager",
      "description": "Command-line password manager with encryption and secure storage",
      "technologies": ["Python"],
      "githubUrl": "https://github.com/MichealNestor01/Encrypted-Password-Manager",
      "image": "/images/portfolio/passwordManagerMain.png",
      "date": "2021-06-21",
      "content": "A command-line program built to learn about encryption and secure password protection. A master password protects the vault; only a hashed version is stored locally for login verification. On login, an encryption key is derived from the plain-text master password and used to encrypt all stored passwords—the key is never saved, so passwords remain secure. Includes an adjustable timeout that forces re-login after a period of inactivity. Skills used: hashing, encryption, and Python callback functions (threading Timer for the timeout).",
      "isRunnable": false,
      "mobileFriendly": false,
      "tags": ["Command Line Tools"]
    },
    {
      "title": "Python Heatmap Generator",
      "slug": "python-heatmap-generator",
      "description": "Scans a black-and-white image and produces a heat map of black pixel density",
      "technologies": ["Python", "tkinter", "PIL"],
      "githubUrl": "https://github.com/MichealNestor01/black-and-white-image-scanner",
      "image": "/images/portfolio/heatmapMain.png",
      "date": "2021-05-01",
      "content": "A commission project from May 2021. Takes a black-and-white image, splits it into 331×331 pixel regions, counts black pixels in each region, and outputs a heat map of black pixel density plus a text file with the count per region. Built with Python using tkinter, datetime, and PIL (Pillow). The repo includes sample output images.",
      "isRunnable": false,
      "mobileFriendly": false,
      "tags": ["Command Line Tools"]
    },
    {
      "title": "Tower of Hanoi Visualiser",
      "slug": "tower-of-hanoi",
      "description": "Animated tower of hanoi puzzle solver with customisable tower size",
      "technologies": ["JavaScript", "Algorithms"],
      "githubUrl": "https://github.com/MichealNestor01/Tower-of-Hanoi-Puzzle",
      "image": "/images/portfolio/towerWide.png",
      "date": "2021-04-25",
      "content": "My computer science teacher challenged me to build a web app to animate the solving of the Tower of Hanoi puzzle. This was after a friend and I were playing with a physical model in class.\n\nThe app computes the full set of moves when the play button is pressed, and then proceeds to play them. The duration of the animation is scaled based on the number of moves required to solve the puzzle.",
      "isRunnable": true,
      "demoUrl": "/projects/Tower-of-Hanoi-Puzzle/index.html",
      "mobileFriendly": false,
      "tags": ["Web Apps"]
    },
    {
      "title": "Sudoku Solver",
      "slug": "sudoku-solver",
      "description": "JavaScript animated Sudoku solver with recursive backtracking",
      "technologies": ["JavaScript", "Algorithms"],
      "githubUrl": "https://github.com/MichealNestor01/Sudoku-Solver",
      "image": "/images/portfolio/sudokuMain.png",
      "date": "2020-07-01",
      "content": "Web app made during lockdown in July. After hitting a roadblock visualising recursive quicksort in the sorting algorithms project, I revisited a recursive backtracking Sudoku solver I had written in Python in January and recreated it in JavaScript to practise animation and async code before returning to quicksort. A major part of the project was getting to grips with asynchronous JavaScript—no sleep(5) like in Python, so I used async/await. The app has two built-in boards; it was also good practice for object-oriented programming in JS.",
      "isRunnable": true,
      "demoUrl": "/projects/Sudoku-Solver/index.html",
      "mobileFriendly": false,
      "tags": ["Web Apps"]
    },
    {
      "title": "Sorting Algorithms Visualiser",
      "slug": "sorting-algorithms-visualiser",
      "description": "Web app that visualises bubble sort and quick sort algorithms",
      "technologies": ["JavaScript", "Algorithms"],
      "githubUrl": "https://github.com/MichealNestor01/Sorting-Algorithms-Visualiser",
      "image": "/images/portfolio/sortingMain.png",
      "date": "2020-04-25",
      "content": "Inspired by my work on sorting algorithms in further maths A-Level and a colour palette creator using the chroma-js library. Wanting to create an animation pushed me to learn how asynchronous code is handled in JavaScript. The bubble sort took about a week; the quick sort took significantly longer. It was my first time using recursion in JavaScript, and the main challenge was animating the recursive function—I did this by manipulating the order of the divs and only colouring the elements currently being sorted to show the recursive nature. I am proud of how it turned out.",
      "isRunnable": true,
      "demoUrl": "/projects/Sorting-Algorithms-Visualiser/index.html",
      "mobileFriendly": false,
      "tags": ["Web Apps"]
    }
  ]
}
