{
  "projects": [
    {
      "title": "Russian Word Profiler",
      "slug": "russian-word-profiler",
      "description": "Linguistics analysis tool for researchers and teachers of Russian",
      "technologies": ["React", "Redux", "Python", "Flask"],
      "githubUrl": "https://github.com/MichealNestor01/RussianWordProfiler/",
      "image": "/images/portfolio/profilerWide.png",
      "date": "2024-08-08",
      "content": "Joint research project with the Russian and Slavonic Studies Department at the University of Leeds. It is a linguistics research tool, and education tool which aims to emulate the feature set of the AntWordProfiler, (Dr Laurence Anthony), except through a web based interface and designed for Russian. This project's point of contact with the department was Dr. Pavel Gudoshnikov and it was developed in collaboration with Ben Thirkill who lead design and UX",
      "isRunnable": true,
      "demoUrl": "https://russianwordprofiler.pythonanywhere.com/",
      "mobileFriendly": false
    },
    {
      "title": "Blackjack in C",
      "slug": "blackjack-in-c",
      "description": "Simple command-line blackjack game written in C",
      "technologies": ["C", "TDD"],
      "githubUrl": "https://github.com/MichealNestor01/blackjack-in-c",
      "image": "/images/portfolio/blackjackMain.png",
      "date": "2025-01-31",
      "content": "My first time using C in over 2 years, and I did not use an LLM assistant for code generation, though ChatGPT did help with the Makefile. Uses Unity for unit tests, and test driven development was followed throughout. There is room for future development to clean up the play_game and play_round functions and add tests for them, as well as player options such as doubling down and surrendering.",
      "isRunnable": false,
      "mobileFriendly": false
    },
    {
      "title": "Jack Compiler",
      "slug": "jack-compiler",
      "description": "Compiler for the Jack language built for COMP2932",
      "technologies": ["C", "Compilers"],
      "githubUrl": "https://github.com/MichealNestor01/jack-compiler",
      "image": "/images/portfolio/compilerDiagram.png",
      "date": "2024-06-01",
      "content": "A compiler that translates the Jack language into Jack VM code using a recursive descent parser. Jack and the VM are the languages from the nand2tetris course. This was the primary assessed piece of work for COMP2932 Compiler Design and Construction; the code was tested using test scripts provided by Dr Mhd. A. Alsalka and received 100% of the available marks.\n\nI am proud of what I accomplished with this program, and it was a great opportunity to cement my confidence in C.",
      "isRunnable": false,
      "mobileFriendly": false
    },
    {
      "title": "Tower of Hanoi Visualiser",
      "slug": "tower-of-hanoi",
      "description": "Animated tower of hanoi puzzle solver with customisable tower size",
      "technologies": ["JavaScript", "Algorithms"],
      "githubUrl": "https://github.com/MichealNestor01/Tower-of-Hanoi-Puzzle",
      "image": "/images/portfolio/towerWide.png",
      "date": "2021-04-25",
      "content": "My computer science teacher challenged me to build a web app to animate the solving of the Tower of Hanoi puzzle. This was after a friend and I were playing with a physical model in class.\n\nThe app computes the full set of moves when the play button is pressed, and then proceeds to play them. The duration of the animation is scaled based on the number of moves required to solve the puzzle.",
      "isRunnable": true,
      "demoUrl": "/projects/Tower-of-Hanoi-Puzzle/index.html",
      "mobileFriendly": false
    },
    {
      "title": "Sorting Algorithms Visualiser",
      "slug": "sorting-algorithms-visualiser",
      "description": "Web app that visualises bubble sort and quick sort algorithms",
      "technologies": ["JavaScript", "Algorithms"],
      "githubUrl": "https://github.com/MichealNestor01/Sorting-Algorithms-Visualiser",
      "image": "/images/portfolio/sortingMain.png",
      "date": "2021-04-25",
      "content": "Inspired by my work on sorting algorithms in further maths A-Level and a colour palette creator using the chroma-js library. Wanting to create an animation pushed me to learn how asynchronous code is handled in JavaScript. The bubble sort took about a week; the quick sort took significantly longer. It was my first time using recursion in JavaScript, and the main challenge was animating the recursive function—I did this by manipulating the order of the divs and only colouring the elements currently being sorted to show the recursive nature. I am proud of how it turned out.",
      "isRunnable": true,
      "demoUrl": "/projects/Sorting-Algorithms-Visualiser/index.html",
      "mobileFriendly": false
    }
  ]
}
